// Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.
// 3, 5 -> 243 (3⁵)
// 2, 4 -> 16

for (int i=1; i<=2; i++)
Console.WriteLine("Input number:");
int i = Convert.ToInt32(Console.ReadLine());

int res = Math.Pow(i,);

for (int res = 1;
)